app/views/lectures/_image_viewer.html.erb

  var maxImageId = 0;
  $(function(){

    var refreshImages = setInterval(function(){
      $.ajax({
        url: "/images/check_incoming.json",
        data:{
          "maxImageId": maxImageId
        },
        success: function(response){

          console.log(response);
          var newImgArrLength = response.length;


          for(var i = 0; i < newImgArrLength; i++){

            newImgJson = response[i];
            if(newImgJson.id > maxImageId){
                maxImageId = newImgJson.id;
              }
            var newImg = $('.lecture-img').append('<%= escape_javascript(render :partial => "lectures/image_form", :locals => {:image=> @blank_image})   %>');
---
SELECT "images".* FROM "images" WHERE "images"."lecture_id" = ? ORDER BY order asc  [["lecture_id", 1]]