app/views/lectures/_note_viewer.html.erb

 //in escape_javascript
  $(function(){
       $("#create_new_note_form").on("ajax:success", function(event, data){
        event.preventDefault();
          console.log("note create succ", data.text, data.name);
          //Clear out create form fields, so that user knows it's done and
          //ready to be used for creating another new note
         $(".new_note_name").val('');
        $(".new_note_body").val('');
          //display the newly create note at top of the list
          var element = $('.note_list').prepend('<%= escape_javascript(render :partial => "lectures/note_update_form", :locals => {:note=> @blank_note})   %>');
          //injects the new values to the update form for this new note
          element.find('#id').first().val(data.id);
          element.find("#note_text").first().val(data.text);
          //feed back delete url
          element.find(".destroy_note").first().attr("href", "/notes/delete/" + data.id);
       });

  });
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "notes".* FROM "notes" WHERE "notes"."lecture_id" = ? ORDER BY created_at DESC LIMIT 1  [["lecture_id", 1]]