app/controllers/images_controller.rb

  def change_order
   # puts params[:new_order]
   #render :text=>"here"
    curr_order = 1
    @new_ids = params[:new_order]
    #@lecture = Lecture.find(@new_ids.first)
    #@images = Image.find(params[:new_order])
    @new_ids.each do |i|
      @image = Image.find(i);
      @image.update_attribute(:order, curr_order)
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "16"]]
UPDATE "images" SET "order" = ?, "updated_at" = ? WHERE "images"."id" = 17  [["order", 2], ["updated_at", Thu, 24 Apr 2014 14:10:37 UTC +00:00]]

  def update
    @image = Image.find(params[:id])
    @image.update(image_params)
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "18"]]
UPDATE "images" SET "name" = ?, "updated_at" = ? WHERE "images"."id" = 18  [["name", "tes1_updated.jpg"], ["updated_at", Fri, 02 May 2014 18:45:53 UTC +00:00]]

  def delete
    @image = Image.find(params[:id])
    @image.destroy
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 16]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 16]]