app/controllers/images_controller.rb

  def change_order
   # puts params[:new_order]
   #render :text=>"here"
    curr_order = 1
    @new_ids = params[:new_order]
    @lecture = Lecture.find(@new_ids.first)
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", 1]]