app/controllers/lectures_controller.rb

  def lecture_viewer
  	@lecture = Lecture.find(params[:id])
    @new_note = Note.new(note_params)
  	@notes = @lecture.notes
  	@images = (@lecture.images).order(:order)
---
SELECT "lectures".* FROM "lectures" WHERE "lectures"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "images".* FROM "images" WHERE "images"."lecture_id" = ? ORDER BY "images"."order" ASC  [["lecture_id", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."lecture_id" = ? AND "notes"."id" = ? ORDER BY created_on DESC LIMIT 1  [["lecture_id", 1], ["id", 1]]