app/controllers/notes_controller.rb

INSERT INTO "notes" ("created_at", "lecture_id", "name", "text", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 30 Apr 2014 20:36:29 UTC +00:00], ["lecture_id", 1], ["name", "asdas"], ["text", "worked!"], ["updated_at", Wed, 30 Apr 2014 20:36:29 UTC +00:00]]
---
  def create
    url = params['url']
    split = url.split "/"
    id = split[split.length-1]

    @note = Note.create(lecture_id:id, text:' ')

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "notes" SET "text" = ?, "updated_at" = ? WHERE "notes"."id" = 1  [["text", "I learned things in class today, oh"], ["updated_at", Mon, 28 Apr 2014 13:27:06 UTC +00:00]]
---
  def update
  	params['contents'].each do |key, val|
      split = key.split "_"
      note = Note.find_by_id(split[1])
      note.update_attributes(text:val)

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]
---
  def delete
    args = params['id']
    split = args.split "_"
    id = split[1]

    if (split[0] == "Note")
      note = Note.find_by_id(id)
      note.destroy