app/controllers/subjects_controller.rb

SELECT "lectures".* FROM "lectures" WHERE "lectures"."subject_id" = ? ORDER BY updated_at DESC  [["subject_id", 1]]
---
  def show
    @lectures = @subject.lectures.order("updated_at DESC");

INSERT INTO "subjects" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 27 Mar 2014 18:45:44 UTC +00:00], ["description", "School subject"], ["name", "Math"], ["updated_at", Thu, 27 Mar 2014 18:45:44 UTC +00:00]]
---
  def create
    @subject = Subject.new(subject_params)

    respond_to do |format|
      if @subject.save

DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 1]]
---
  def destroy
    @subject.destroy