app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects"
---
  def show
    valid = false

    current_user.subjects.each do |subject|